# Homework 02

## **Part 1 - Highest and Lowest Annual Wage for Computer and Data Occupations**

In [ ]:
import csv

In [ ]:
current_lowest = float("inf")
current_highest = float("-inf")
title_lowest = ""
title_highest = ""

with open('/content/occupations-truncated.csv', 'r') as file:
    my_reader = csv.reader(file, delimiter=',')
    for row in my_reader:
      title = row[1].lower()
      if row[2] == "detail" and ("data" in title or "computer" in title):
        annual_mean_wage = row[4].replace("$","")
        annual_mean_wage = int(annual_mean_wage.replace(",",""))
        if annual_mean_wage < current_lowest:
          current_lowest = annual_mean_wage
          title_lowest = row[1]
        if annual_mean_wage > current_highest:
          current_highest = annual_mean_wage
          title_highest = row[1]

In [ ]:
print("Occupation title and Annual mean wage for the highest Annual mean wage: ", (title_highest,current_highest))

Occupation title and Annual mean wage for the highest Annual mean wage:  ('Computer and Information Systems Managers', 161730)

In [ ]:
print("Occupation title and Annual mean wage for the lowest Annual mean wage: ", (title_lowest,current_lowest))

Occupation title and Annual mean wage for the lowest Annual mean wage:  ('Data Entry Keyers', 35850)

## **Part 3 - nelta.py and Occupations with Annual Wage > $200,000**

In [1]:
import nelta as nt

In [2]:
## TODO: modify the path
table = nt.read_csv("/content/occupations-truncated.csv")

In [3]:
# display the number of rows and columns for your Table

table.shape()

(1034, 5)

In [4]:
# show the columns in your Table
table.columns

['Occupation code',
 'Occupation title',
 'Level',
 'Employment',
 'Annual mean wage']

In [5]:
#  display the first 4 rows of the dataset
print(table.head(4))

                                   Occupation code                    Occupation title                   Level                              Employment                         Annual mean wage
0                                  00-0000                            All Occupations                    total                              139099570.0                        $56,310
1                                  11-0000                            Management Occupations             major                              7947300.0                          $126,480
2                                  11-1000                            Top Executives                     minor                              2601070.0                          $129,920
3                                  11-1011                            Chief Executives                   detail                             202360.0                           $197,840

In [6]:
# save the last 4 rows of the data set into a variable called last_four
last_four = table.tail(4)
print(last_four)

                                   Occupation code                    Occupation title                   Level                              Employment                         Annual mean wage
1030                               53-7073                            Wellhead Pumpers                   detail                             12050.0                            $60,500
1031                               53-7081                            Refuse and Recyclable Material Collectorsdetail                             120850.0                           $42,620
1032                               53-7121                            Tank Car, Truck, and Ship Loaders  detail                             12610.0                            $50,670
1033                               53-7199                            Material Moving Workers, All Other detail                             26300.0                            $37,770

In [7]:
# show only the label ("index") and Employment column of last_four as a LabeledList (no column name needed)
print(last_four['Employment'])

1030  12050.0
1031 120850.0
1032  12610.0
1033  26300.0

In [8]:
#  loop over the Employment column as a LabeledList and print out each value
for value in last_four['Employment']:
  print(value)

12050.0
120850.0
12610.0
26300.0

In [9]:
# show the label ("index") and both the Occupation title and Employment columns of last_four as a Table (include column names)
print(last_four[["Occupation title","Employment"]])

                                   Occupation title                   Employment
1030                               Wellhead Pumpers                   12050.0
1031                               Refuse and Recyclable Material Collectors120850.0
1032                               Tank Car, Truck, and Ship Loaders  12610.0
1033                               Material Moving Workers, All Other 26300.0

In [10]:
# using your original, unaltered Table , find all rows with Level detail and save to a variable called details

temp = []
detail_bool = table['Level']=="detail"
for val in detail_bool:
  temp.append(eval(val))

details = table[temp]

In [11]:
# find the number of rows in your details Table :
details.shape()[0]

772

In [12]:
#  using your details Table , use the column Employment use the less than operator ( < ) to compare with 500… save this to a variable called my_filter
my_filter = details['Employment']<500

In [13]:
# get the type of my_filter using the function type (it should be a LabeledList)
type(my_filter)

nelta.LabeledList

In [14]:
#  index into your my_filter with 3 (you should get False )
my_filter.values()[3]

'False'

In [15]:
# use your my_filter variable as the index to your details Table – this translates to showing all occupations in your details Table that have Employment less than 500

temp = []
for val in my_filter.values():
  temp.append(eval(val))

print(details[temp])

                                   Occupation code                    Occupation title                   Level                              Employment                         Annual mean wage
508                                35-2013                            Cooks, Private Household           detail                             320.0                              $46,810
916                                51-7032                            Patternmakers, Wood                detail                             190.0                              $60,750

In [16]:
#  perform the same calculation as above, but save your resulting Table into a variable called rare_occ

temp = []
for val in my_filter.values():
  temp.append(eval(val))

rare_occ = details[temp]

In [18]:
# using your rare_occ table, transform the Occupation title to uppercase by using map on the column (that is, index into the Table first, and then use map )
def upper(s):
  s = s.upper()
  return s
print(rare_occ['Occupation title'].map(upper))

508 COOKS, PRIVATE HOUSEHOLD
916      PATTERNMAKERS, WOOD

In [21]:
# this is a tricky one! combine some of the functionality from the previous steps to find the occupation data that have an
# Annual mean wage greater than 200,000 (hint, you'll have to convert the wage to a numeric type)

def money_to_number(s):
  s = s.replace("$","")
  s = s.replace(",","")
  return float(s)
money = table['Annual mean wage'].map(money_to_number)
money_bool = money > 200000

temp = []
for val in money_bool.values():
  temp.append(eval(val))

greater_than_200k = table[temp]
print(greater_than_200k)

                                   Occupation code                    Occupation title                   Level                              Employment                         Annual mean wage
383                                29-1022                            Oral and Maxillofacial Surgeons    detail                             4120.0                             $234,990
384                                29-1023                            Orthodontists                      detail                             5040.0                             $237,990
385                                29-1024                            Prosthodontists                    detail                             530.0                              $214,870
407                                29-1211                            Anesthesiologists                  detail                             28590.0                            $271,440
408                                29-1215                            Family Medicine Physicians         detail                             98590.0                            $214,370
409                                29-1216                            General Internal Medicine Physiciansdetail                             50600.0                            $210,960
410                                29-1218                            Obstetricians and Gynecologists    detail                             18900.0                            $239,120
412                                29-1223                            Psychiatrists                      detail                             25540.0                            $217,100
413                                29-1228                            Physicians, All Other; and Ophthalmologist...detail                             375390.0                           $218,850
414                                29-1248                            Surgeons, Except Ophthalmologists  detail                             37900.0                            $251,650